# Домашнее задание по теме: MySQL

## ERR Model

<img src="../hw/images/eer_model_hw.png"/>

In [1]:
import sqlalchemy
from sqlalchemy import create_engine
import pandas as pd

# данные для подключения к серверу MySQL
user='admin'
password='password'
host='127.0.0.1'
port='3306'

# название БД, с которой будем работать (создавать, удалять, изменять ...)
db_name='hw_db'

In [2]:
engine = create_engine(f"mysql+pymysql://{user}:{password}@{host}:{port}")
engine

Engine(mysql+pymysql://admin:***@127.0.0.1:3306)

## Создание БД

In [3]:
with engine.connect() as connection:
    connection.execute(f'DROP DATABASE IF EXISTS {db_name}')
    connection.execute(f'CREATE DATABASE {db_name}')
    connection.execute(f'USE {db_name}')

## Создание таблиц

In [4]:
with engine.connect() as connection:
    connection.execute("CREATE TABLE items ( \
                        id INT UNSIGNED NOT NULL AUTO_INCREMENT, \
                        name VARCHAR(20) NOT NULL, \
                        type ENUM('dry', 'wet') NOT NULL, \
                        expiration_date DATE NOT NULL, \
                        PRIMARY KEY(id))")

In [5]:
with engine.connect() as connection:
    connection.execute("CREATE TABLE categories ( \
                        id INT UNSIGNED NOT NULL AUTO_INCREMENT, \
                        name VARCHAR(50) NOT NULL, \
                        PRIMARY KEY(id))")

In [6]:
with engine.connect() as connection:
    connection.execute("""CREATE TABLE prices ( 
                        item_id INT UNSIGNED NOT NULL, 
                        price FLOAT NOT NULL, 
                        FOREIGN KEY (item_id) 
                        REFERENCES items(id) 
                        ON DELETE CASCADE
                        ON UPDATE CASCADE)""")

In [7]:
with engine.connect() as connection:
    connection.execute("""CREATE TABLE items_categories ( 
                        item_id INT UNSIGNED NOT NULL, 
                        category_id INT UNSIGNED NOT NULL,
                        FOREIGN KEY (category_id) 
                        REFERENCES categories(id) 
                        ON DELETE CASCADE 
                        ON UPDATE CASCADE, 
                        FOREIGN KEY (item_id) 
                        REFERENCES items(id) 
                        ON DELETE CASCADE \
                        ON UPDATE CASCADE)""")

## Заполнение таблиц

In [8]:
with engine.connect() as connection:
    connection.execute("""INSERT INTO items (name, type, expiration_date) VALUES 
                        ('Колбаса', 'dry', '2021-05-20'), 
                        ('Сыр', 'dry', '2021-03-10'), 
                        ('Вода', 'wet', '2022-05-20'), 
                        ('Салат', 'wet', '2021-01-10'), 
                        ('Молоко', 'wet', '2021-03-15')
                        """)

In [9]:
items_df = pd.read_sql_query("SELECT * FROM items", engine)
items_df

   id     name type expiration_date
0   1  Колбаса  dry      2021-05-20
1   2      Сыр  dry      2021-03-10
2   3     Вода  wet      2022-05-20
3   4    Салат  wet      2021-01-10
4   5   Молоко  wet      2021-03-15

In [10]:
with engine.connect() as connection:
    connection.execute("""INSERT INTO categories (name) VALUES 
                        ('Молочные продукты'), 
                        ('Колбасы'), 
                        ('Напитки'), 
                        ('Кулинария')""")

In [11]:
categories_df = pd.read_sql_query("SELECT * FROM categories", engine)
categories_df

   id               name
0   1  Молочные продукты
1   2            Колбасы
2   3            Напитки
3   4          Кулинария

In [12]:
with engine.connect() as connection:
    connection.execute("""INSERT INTO prices (item_id, price) VALUES 
                        ('1', '150.86'), 
                        ('2', '1010.10'), 
                        ('3', '20.50'), 
                        ('4', '450.60'), 
                        ('5', '95.75')""")

In [13]:
prices_df = pd.read_sql_query("SELECT * FROM prices", engine)
prices_df

   item_id    price
0        1   150.86
1        2  1010.10
2        3    20.50
3        4   450.60
4        5    95.75

In [14]:
with engine.connect() as connection:
    connection.execute("""INSERT INTO items_categories (item_id, category_id) VALUES 
                        ('1', '2'), 
                        ('2', '1'), 
                        ('3', '3'), 
                        ('4', '4'), 
                        ('5', '1'), 
                        ('5', '3')""")

In [15]:
items_categories_df = pd.read_sql_query("SELECT * FROM items_categories", engine)
items_categories_df

   item_id  category_id
0        1            2
1        2            1
2        3            3
3        4            4
4        5            1
5        5            3

## Обновление данных

In [16]:
with engine.connect() as connection:
    connection.execute("UPDATE items SET name='Сосиски' WHERE name='Колбаса'")

In [17]:
items_df = pd.read_sql_query("SELECT * FROM items", engine)
items_df

   id     name type expiration_date
0   1  Сосиски  dry      2021-05-20
1   2      Сыр  dry      2021-03-10
2   3     Вода  wet      2022-05-20
3   4    Салат  wet      2021-01-10
4   5   Молоко  wet      2021-03-15

## Удаление данных

In [18]:
with engine.connect() as connection:
    connection.execute("DELETE FROM items WHERE name='Вода'")

In [19]:
items_df = pd.read_sql_query("SELECT * FROM items", engine)
items_df

   id     name type expiration_date
0   1  Сосиски  dry      2021-05-20
1   2      Сыр  dry      2021-03-10
2   4    Салат  wet      2021-01-10
3   5   Молоко  wet      2021-03-15

In [20]:
items_categories_df = pd.read_sql_query("SELECT * FROM items_categories", engine)
items_categories_df

   item_id  category_id
0        1            2
1        2            1
2        4            4
3        5            1
4        5            3

In [21]:
prices_df = pd.read_sql_query("SELECT * FROM prices", engine)
prices_df

   item_id    price
0        1   150.86
1        2  1010.10
2        4   450.60
3        5    95.75

## Получение данных (с условиями)

In [22]:
n = 400
prices_df = pd.read_sql_query(f"SELECT * FROM prices WHERE price > {n}", engine)
prices_df

   item_id   price
0        2  1010.1
1        4   450.6

In [23]:
prices_df = pd.read_sql_query("EXPLAIN SELECT * FROM prices WHERE price > 400", engine)
prices_df

,id,select_type,table,partitions,type,possible_keys,key,key_len,ref,rows,filtered,Extra
0,1,SIMPLE,prices,None,ALL,None,None,None,None,4,33.33,Using where

In [24]:
n = 400
m = 1
prices_df = pd.read_sql_query(f"SELECT * FROM prices WHERE price > {n} AND item_id != 4", engine)
prices_df

   item_id   price
0        2  1010.1

In [25]:
prices_df = pd.read_sql_query(f"EXPLAIN SELECT * FROM prices WHERE price > {n} AND item_id != 4", engine)
prices_df

,id,select_type,table,partitions,type,possible_keys,key,key_len,ref,rows,filtered,Extra
0,1,SIMPLE,prices,None,range,item_id,item_id,4,None,3,33.33,Using index condition; Using where

In [27]:
first_char = 'С'
items_df = pd.read_sql_query(f"""SELECT * FROM items 
                                 WHERE name LIKE '{first_char}%%'""",
                             engine)
items_df

   id     name type expiration_date
0   1  Сосиски  dry      2021-05-20
1   2      Сыр  dry      2021-03-10
2   4    Салат  wet      2021-01-10